[
  {
    "name": "KRISTINE FROSETH",
    "role": "Darcie",
    "headshot_img": "../images/_people/froseth2.jpg",
    "bio": "Kristine Froseth can currently be seen in Paul Schrader’s <i>Oh Canada</i>, opposite Jacob Elordi and Richard Gere, which premiered at this year’s Cannes and TIFF. Kristine currently stars as “Nan St. George” in the Apple TV+ series adaption of Edith Wharton’s final novel, “The Buccaneers,” and in the psychological thriller <i>Desert Road</i>, for producers Roy Lee and Steven Schneider, which just premiered at this year’s SXSW to rave reviews. She was last seen in the independent feature <i>How To Blow Up A Pipeline</i> for NEON, which premiered in the prestigious Platform section at TIFF, and as the lead in Lena Dunham’s feature <i>Sharp Stick</i>, supported by Jon Bernthal, Jennifer Jason Leigh, and Taylour Paige, which premiered at Sundance 2022, and in Showtime’s limited series “The First Lady” opposite Michelle Pfeiffer and Viola Davis for director Susanne Bier. Previous credits include Kitty Green’s acclaimed feature <i>The Assistant</i> for Bleecker Street, which screened at Telluride, Sundance, and the Berlin Film Festival to rave reviews, the lead of Sarah Adina Smith’s feature <i>Birds Of Paradise</i> for Amazon, which was set up and greenlit for her, the title role in the Hulu limited series “Looking For Alaska,” based on John Green’s acclaimed first novel, and Gareth Evan’s <i>Apostle</i>, opposite Dan Stevens and Michael Sheen. Kristine is repped by CAA, Anonymous Content, and Hansen, Jacobson, Teller, Hoberman."
  },
  {
    "name": "KATHRYN GALLAGHER",
    "role": "Jacqueline",
    "headshot_img": "../images/_people/gallagher2.jpg",
    "bio": "Kathryn Gallagher is a Tony nominated and Grammy-winning singer, songwriter and actress. Gallagher can currently be seen in Anna Kendrick’s hugely popular directorial debut feature <i>Woman of The Hour</i> on Netflix which made its premiere at the Toronto Film Festival. Gallagher also stars in Alex Ross Perry's <i>Pavements</i>, a musical biopic concert film, which premiered at the 2024 Venice Film Festival and NYFF. On stage, Kathryn made her Broadway debut as the Martha in the Tony nominated Deaf West revival of <i>Spring Awakening</i> in 2015. She returned to Broadway as Bella in Alanis Morisette’s musical <i>Jagged Little Pill</i>. The show, based on the album, was written with Diablo Cody, and directed by Diane Paulus. The role led her to a Tony Award nomination in the category of ‘Best Featured Actress in a Musical,’ and a Grammy Award win as a principle in the category of ‘Best Musical Theatre Album.’ On television, Kathryn was seen on Netflix’s mega hit show “You,” as Annika. In the series, which was produced by Greg Berlanti and Sera Gamble, Kathryn starred alongside John Stamos, Penn Badgley and Shay Mitchell. She was also seen in MAX’s “Gossip Girl,” Amazon’s “Modern Love” and The CW’s “The Flash.” Kathryn is also an accomplished singer songwriter whose music has had placements in film/TV such as “Younger” “Covert Affairs” and Stuart Blumberg’s “Thanks For Sharing.” She continues to work on new music, working alongside accomplished writers from all over the world. Her new single “The Sweetest Song,” which is also featured in <i>Woman of The Hour</i>, was released this fall. Gallagher is repped by Gersh and CIRCLE MANAGEMENT + PRODUCTION."
  },
  {
    "name": "JULIA LESTER",
    "role": "Wilma",
    "headshot_img": "../images/_people/lester2.jpg",
    "bio": "Julia Lester is best known as “Ashlyn Moon Caswell” on the hit TV show “High School Musical: The Musical: The Series” on Disney+, where she has been a series regular for all four seasons. She made her Broadway debut last summer as “Little Red Riding-hood” in the critically acclaimed revival of <i>Into the Woods</i>, garnering her nominations for the 2023 Tony Award for Best Performance by an Actress in a Featured Role in a Musical, Drama Desk, Outer Critics Circle, and Clive Barnes Award. She is also the winner of the 2023 Broadway.com Audience Choice Award for Favorite Breakthrough Performance and is featured on the show’s Grammy-winning cast album. Julia received rave reviews for her performance as “Miss Marmelstein” in <i>I Can Get It For You Wholesale</i> at Classic Stage Company as well as “Martha” in Center Theatre Group’s production of <i>The Secret Garden</i>. Lester also guest appeared in a memorable recurring arc on CBS’ acclaimed sitcom “Mom” opposite Anna Faris and Allison Janney. Most recently, Julia starred opposite Antonia Gentry in Hulu’s feature film <i>Prom Dates</i>."
  },
  {
    "name": "HAVANA ROSE&nbsp;LIU",
    "role": "Lizzy",
    "headshot_img": "../images/_people/liu2.jpg",
    "bio": "Havana Rose Liu recently wrapped shooting the independent feature <i>Tuner</i>, for Oscar-winning filmmaker Daniel Roher, starring opposite Leo Woodall and Dustin Hoffman. She can next be seen in the indie feature <i>Lurker</i> for writer and director Alex Russell and executive producer Chris Storer, opposite Archie Madwekwe and in Cooper Raiff’s highly anticipated independent series “Hal & Harper,” opposite Raiff, Mark Ruffalo, and Lili Reinhart. Following this, she will be seen in John Carney’s feature film <i>Power Ballad</i>, opposite Paul Rudd and Nick Jonas, as well as Michael Showalter’s feature film <i>Oh What Fun</i> for Amazon, opposite Michelle Pfieffer and Dominic Sessa. Havana broke out in 2023 for her role in Emma Selgiman’s satirical comedy feature <i>Bottoms</i>, opposite Rachel Sennott and Ayo Edebiri, which premiered at South by Southwest, to stellar reviews. Past credits include the Hulu Original <i>No Exit</i>, as well as A24’S <i>The Sky Is Everywhere</i>. Havana is repped by CAA, IMG, Anonymous Content, and Schreck Rose Dapello."
  },
  {
    "name": "ALYAH CHANELLE SCOTT",
    "role": "Tessa",
    "headshot_img": "../images/_people/scott2.jpg",
    "bio": "Alyah Chanelle Scott is an actor, producer and director dedicated to engaging audiences with unique and imaginative stories both onstage and onscreen. Scott currently stars as “Whitney Chase” on Mindy Kaling’s Max comedy series “The Sex Lives of College Girls,” which recently returned for its third season this past November. She recently completed production on “Hal & Harper,” a limited series from Cooper Raiff, alongside Mark Ruffalo and Lili Reinhart. She previously starred in Steven Levitan’s comedy series “Reboot” on Hulu. She is the co-founder of Runyonland Productions, a full-service production company alongside Thomas Laub. Together, the three-time Tony Award-winning producers have credits including <i>Appropriate</i> (2024 Tony Award – Best Revival of a Play), <i>Gutenberg! The Musical!</i>, David Byrne’s <i>American Utopia</i> (2021 Special Tony Award), <i>Parade</i> (2023 Tony Award – Best Revival of Musical), <i>A Doll’s House</i> and <i>The Sign In Sidney Brustien’s Window</i>. Scott has also embarked on a directing career, helming music videos for Renee Rapp (“Snow Angel,” “Talk too Much”). In 2024 <i>Forbes Magazine</i> named her to their 30 Under 30 list for her diverse skill set and resume. Scott is repped by The Gersh Agency, Lighthouse Management & Media, Viewpoint, and Hansen, Jacobson, Teller, Hoberman, Newman, Warren & Richman, L.L.P."
  },
  {
    "name": "Tessa Albertson",
    "role": "Understudy",
    "headshot_img": "../images/_people/albertson.jpg",
    "bio": "Theatre: <i>Shrek</i> (Broadway), <i>The Low Road</i> (Public Theatre), <i>I’m Gonna Marry You Tobey Maguire</i> (Off-Broadway, Off West End, Offie Award Nomination). Television: “Younger”, “The Good Wife”, “Instinct”, “Law & Order: SVU”, “The Family.” Film: November <i>Criminals, Barry, Blame</i>. Princeton University."
  },
  {
    "name": "Olivia Puckett",
    "role": "Understudy",
    "headshot_img": "../images/_people/puckett.jpg",
    "bio": "she/her. Broadway: <i>Dear Evan Hansen</i> (OBC), <i>Motown</i>. Off-Broadway: <i>The Big Gay Jamboree</i> (Orpheum Theater), <i>The Panic of '29</i> (59E59). National Tours: <i>Hamilton, Motown, Green Day's American Idiot</i>. Film/Television: “Elsbeth” (CBS), “Winning Time: The Rise of the Lakers Dynasty” (HBO); <i>Theater Camp</i> (Searchlight)."
  }
]
